import FigureTask.TestFigure;
import HouseTask.TestHouse;

/**
 1. Сделать библиотеку, которая ведет учет книг. Должно быть как минимум два класса: Book и Library. \
 Library имеет два метода: void put(Book book, int quantity) и int get(Book book, int quantity).
 Каждой книге в библиотеке соответствует счетчик, показывающий количество хранящихся книг,
 при добавлении книги - счетчик увеличивается, при извлечении - уменьшается на число quantity.
 Поля класса Book: author, title, pagesNum.
 Библиотека хранит ограниченное число книг, сколько - на ваше усмотрение.


 2. Создать фигуры: Circle, Rectangle, Triangle, у которых будут координаты.
 Все фигуры должны иметь методы, которые возвращают площадь и периметр (для окружности - длина окружности).


 3. Дом строется со следующими характеристиками:
 Что из низ задается через конструктор, а что потом - решайте сами
 1. какое-то количество подъездов
 2. какое-то количество этажей
 3. какое-то количество квартир на этаже
 4. адрес
 У дома должна быть возможность сообщить, сколько в нем квартир - метод
 У дома должна быть возможность показать адрес - метод
 У дома должна быть возможность сообщить, сколько людей в нем живет - метод

 Есть очередь людей (массив с объектами класса Human),
 каждый хочет заселиться в дом , но у каждого есть пожелание - этажность дома!

 Одновременно в дом можно заселить троих.
 house.add(); при вызове этого метода можно заселить только 3х людей

 Людей из списка можно заселять в дом (по квартире на человека),
 если в нем есть еще свободные квартиры
 и если их пожелание можно учесть (желаемый этаж должен быть в доме).

 Если человека нельзя поселить, потому что его пожелание не выполняется,
 он перемещяется в конец очереди.
 Если не хватило места - остается на прежнем месте, ждать нового дома

 */

public class Main {
    public static void main(String[] args){
        TestLibrary.testLibrary();
        System.out.println("**************************************************************");
        TestFigure.testFigure();
        System.out.println("**************************************************************");
        TestHouse.testHouse();
    }
}


