package goodsList.src;

/**
 проект goodsList

 1.
 Сведения о покупках вводятся в формате: покупатель(строка), товар(строка), количество(число),
 по команде add data -
 Создать список всех покупетелей,
 для каждого покупателя подсчитать количество приобретенных им едениц
 каждого вида товаров
 Вывод
 по команде show data:

 Имя:
 название товара количество
 название товара количество


 Имя:
 название товара количество
 название товара количество


 Выход из программы по команде close

 */


public class Main {
    public static void main(String[] args) {
        StartDialog.startDialog();
    }
}
